scratch/tmp/pytest-of-Micha/pytest-0/test_pipe_presets_water_flow_0/case/constant/transportProperties
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object transportProperties;
}
transportModel Newtonian;
nu [0 2 -1 0 0 0 0] 1.0038068523342016e-06;
