scratch/tmp/pytest-of-Micha/pytest-0/test_pipe_presets_water_flow_0/case/constant/turbulenceProperties
/* GustSim · OpenCFD OpenFOAM v2606 */
FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object turbulenceProperties;
}
simulationType laminar;
